noless-zz/esp8266-led-strip-clock/src/main.cpp
/*
 * ESP8266 LED Strip Clock
 * 60-LED NeoPixel time display with NTP sync and timezone auto-detection
 * Features: WiFi captive portal, firmware OTA upload, time sync, color blending
 */

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESPAsyncWebServer.h>
#include <ESPAsyncTCP.h>
#include <DNSServer.h>
#include <ArduinoJson.h>
#include <ArduinoOTA.h>
#include <ESP8266mDNS.h>
#include <Adafruit_NeoPixel.h>
#include <EEPROM.h>
#include <Updater.h>
#include <time.h>
#include <sys/time.h>

#ifndef NUM_LEDS
#define NUM_LEDS 60
#endif
#ifndef LED_PIN
#define LED_PIN D4
#endif

// Build timestamp - compiler generates this automatically
const char* FW_VERSION_BASE = "2.0.0";
const char* FW_BUILD_TIME = __DATE__ " " __TIME__;
const char* AP_SSID = "LED-Clock";
const char* AP_PASS = "";
const char* OTA_PASS = "admin123";
const char* NTP_SERVER = "pool.ntp.org";
const byte DNS_PORT = 53;
const int MAX_SCAN_CACHE = 30;

// Display modes
enum DisplayMode {
  DISPLAY_SOLID = 0,        // Rainbow orbit with HMS markers
  DISPLAY_SIMPLE = 1,       // Clean 3-LED HMS (red/green/blue)
  DISPLAY_PULSE = 2,        // Subtle pulse with HMS
  DISPLAY_BINARY = 3,       // Binary clock stretched to 60 LEDs
  DISPLAY_HOUR_MARKER = 4,  // Minute progress with hour beacon
  DISPLAY_FLAME = 5,        // Optimized flame effect with HMS
  DISPLAY_PASTEL = 6,       // Soft pastel HMS colors
  DISPLAY_NEON = 7,         // Bright neon HMS
  DISPLAY_COMET = 8,        // Animated HMS comet trails
  DISPLAY_MAX = 9
};

// EEPROM Layout
const int EEPROM_SIZE = 512;
const int EEPROM_MAGIC_ADDR = 0;
const int EEPROM_SSID_ADDR = 1;
const int EEPROM_PASS_ADDR = 65;
const int EEPROM_BRIGHTNESS_ADDR = 129;
const int EEPROM_TZ_OFFSET_ADDR = 130;
const int EEPROM_DISPLAY_MODE_ADDR = 134;
const int EEPROM_MODE_CFG_MAGIC_ADDR = 135;
const int EEPROM_MODE_CFG_BASE_ADDR = 160;
const uint8_t EEPROM_MODE_CFG_MAGIC = 0x5C;
const int EEPROM_RGBW_ADDR = 136;          // 1 byte: 1=RGBW, 0=RGB
const int EEPROM_REVERSED_ADDR = 137;      // 1 byte: 1=reversed, 0=normal
const uint8_t EEPROM_MAGIC = 0xA7;
const int MAX_SSID_LEN = 32;
const int MAX_PASS_LEN = 64;

// Global state - LEDs
Adafruit_NeoPixel *ledStrip = nullptr;
uint8_t ledBrightness = 76;  // 30%
DisplayMode displayMode = DISPLAY_SOLID;
struct CRGB { uint8_t r, g, b; } leds[NUM_LEDS];
bool ledRgbw = false;        // false=RGB, true=RGBW
bool ledReversed = false;    // false=normal (0ΓåÆ59), true=reversed (59ΓåÆ0)

struct ModeDisplayConfig {
  uint8_t hourR, hourG, hourB;
  uint8_t minuteR, minuteG, minuteB;
  uint8_t secondR, secondG, secondB;
  uint8_t hourWidth;
  uint8_t minuteWidth;
  uint8_t secondWidth;
  uint8_t spectrum;
};

ModeDisplayConfig modeConfigs[DISPLAY_MAX];

// Web server
AsyncWebServer server(80);
DNSServer dnsServer;
bool mdnsStarted = false;

// WiFi state
struct ScanCacheEntry {
  String ssid;
  int32_t rssi = 0;
  int channel = -1;
  int enc = -1;
  bool hasBssid = false;
};
ScanCacheEntry scanCache[MAX_SCAN_CACHE];
int scanCacheCount = 0;
unsigned long scanCacheUpdatedAt = 0;

struct {
  bool active = false;
  bool connecting = false;
  bool success = false;
  String attemptedSsid;
  String error = "";
  unsigned long startedAt = 0;
  wl_status_t lastStatus = WL_DISCONNECTED;
} wifiConnect;

bool wifiConnected = false;
unsigned long lastNtpSync = 0, lastTzCheck = 0;
struct { int32_t utcOffset; String name; bool autoDetected; } tz = {0, "UTC", true};
bool forceClockDisplay = false;   // show clock even before NTP
bool forceStatusDisplay = false;  // show boot animation even after NTP synced
String savedSsid;   // credentials loaded from EEPROM, used after AP is up
String savedPass;
struct {
  String source = "ip-api.com";
  String status = "idle";
  String message = "not started";
  String responseSample = "";
  int httpCode = 0;
  unsigned long lastAttemptMs = 0;
  unsigned long lastSuccessMs = 0;
} tzDiag;

// OTA state
struct {
  bool inProgress = false;
  bool approved = false;
  bool lastSuccess = false;
  uint8_t lastErrorCode = 0;
  String lastErrorText = "";
  String lastFileName = "";
  uint32_t expectedBytes = 0;
  uint32_t writtenBytes = 0;
  unsigned long startedAt = 0;
  unsigned long finishedAt = 0;
} otaStatus;

// Forward declarations for display functions
void displayMode_Simple();
void displayMode_Pulse();
void displayMode_Pastel();
void displayMode_Binary();
void displayMode_HourMarker();
void displayMode_Neon();
void displayMode_Comet();
void displayMode_Flame();
void displayClock_Solid();
void setDefaultModeConfigs();
void loadModeConfigsFromEEPROM();
void saveModeConfigToEEPROM(uint8_t mode);
void saveDisplayModeToEEPROM();

// ============================================================================
// LED Functions
// ============================================================================

void setupLEDs() {
  if (ledStrip) delete ledStrip;
  uint16_t ledType = ledRgbw ? (NEO_GRBW + NEO_KHZ800) : (NEO_GRB + NEO_KHZ800);
  ledStrip = new Adafruit_NeoPixel(NUM_LEDS, LED_PIN, ledType);
  ledStrip->begin();
  ledStrip->setBrightness(ledBrightness);
  ledStrip->clear();
  ledStrip->show();
  Serial.printf("[LED] 60-LED %s clock initialized\n", ledRgbw ? "RGBW" : "RGB");
}

void showLEDs() {
  if (!ledStrip) return;
  for (int i = 0; i < NUM_LEDS; i++) {
    int phys = ledReversed ? (NUM_LEDS - 1 - i) : i;
    if (ledRgbw)
      ledStrip->setPixelColor(phys, ledStrip->Color(leds[i].r, leds[i].g, leds[i].b, 0));
    else
      ledStrip->setPixelColor(phys, ledStrip->Color(leds[i].r, leds[i].g, leds[i].b));
  }
  ledStrip->show();
}

// ============================================================================
// Display Mode Functions
// ============================================================================

uint8_t addSat(uint8_t base, uint8_t add) {
  uint16_t v = (uint16_t)base + add;
  return (v > 255) ? 255 : (uint8_t)v;
}

void addPixelWrap(int index, uint8_t r, uint8_t g, uint8_t b) {
  int pos = index % NUM_LEDS;
  if (pos < 0) pos += NUM_LEDS;
  leds[pos].r = addSat(leds[pos].r, r);
  leds[pos].g = addSat(leds[pos].g, g);
  leds[pos].b = addSat(leds[pos].b, b);
}

void hsvToRgb(uint16_t hue, uint8_t sat, uint8_t val, uint8_t &r, uint8_t &g, uint8_t &b) {
  hue %= 360;
  uint8_t region = hue / 60;
  uint16_t rem = (hue % 60) * 255 / 60;
  uint8_t p = (uint16_t)val * (255 - sat) / 255;
  uint8_t q = (uint16_t)val * (255 - ((uint16_t)sat * rem / 255)) / 255;
  uint8_t t = (uint16_t)val * (255 - ((uint16_t)sat * (255 - rem) / 255)) / 255;
  switch (region) {
    case 0: r = val; g = t; b = p; break;
    case 1: r = q; g = val; b = p; break;
    case 2: r = p; g = val; b = t; break;
    case 3: r = p; g = q; b = val; break;
    case 4: r = t; g = p; b = val; break;
    default: r = val; g = p; b = q; break;
  }
}

void applyBrightnessAndShow() {
  for (int i = 0; i < NUM_LEDS; i++) {
    leds[i].r = (uint16_t)leds[i].r * ledBrightness / 255;
    leds[i].g = (uint16_t)leds[i].g * ledBrightness / 255;
    leds[i].b = (uint16_t)leds[i].b * ledBrightness / 255;
  }
  showLEDs();
}

bool extractClock(int &hour12, int &hour24, int &minute, int &second, int &daySeconds) {
  time_t now = time(nullptr);
  if (now < 86400) {
    memset(leds, 0, sizeof(leds));
    leds[0] = {255, 0, 0};
    leds[NUM_LEDS - 1] = {255, 0, 0};
    showLEDs();
    return false;
  }
  struct tm* t = localtime(&now);
  hour24 = t->tm_hour;
  hour12 = t->tm_hour % 12;
  minute = t->tm_min;
  second = t->tm_sec;
  daySeconds = hour24 * 3600 + minute * 60 + second;
  return true;
}

CRGB blendSpectrumColor(const CRGB &base, uint8_t spectrum, uint8_t level, uint16_t phaseSeed) {
  if (spectrum == 0) return base;

  uint8_t rr = base.r;
  uint8_t gg = base.g;
  uint8_t bb = base.b;

