noless-zz/esp8266-led-strip-clock/src/main.cpp
void displayMode_Neon() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_NEON];

  memset(leds, 0, sizeof(leds));
  overlayTimeMarkers(hour12, minute, second, cfg, 2);
  applyBrightnessAndShow();
}

void displayMode_Comet() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_COMET];

  memset(leds, 0, sizeof(leds));
  int cometTail = 4 + (int)cfg.secondWidth * 2;
  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t dim = (uint8_t)(2 + (i % 7));
    leds[i] = {dim, dim, dim};
  }
  overlayTimeMarkers(hour12, minute, second, cfg, cometTail);
  applyBrightnessAndShow();
}

void displayMode_Flame() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_FLAME];

  // Optimize: update flame only every 50ms (20 times/sec instead of 60)
  static uint32_t lastUpdate = 0;
  uint32_t now = millis();
  
  if (now - lastUpdate > 50) {  // Update max 20 times/sec instead of 60
    lastUpdate = now;
    uint32_t phase = now / 40;  // Slower phase calculation
    
    for (int i = 0; i < NUM_LEDS; i++) {
      // Simplified pseudo-random without heavy multiplication
      uint32_t x = (uint32_t)(i * 41 + phase * 7);
      uint8_t flicker = (uint8_t)((x ^ (x >> 4)) & 0x3F);  // Reduced bit ops
      uint8_t r = 80 + flicker;
      uint8_t g = 15 + flicker / 3;
      uint8_t b = 2;
      leds[i] = {r, g, b};
    }
  }

  overlayTimeMarkers(hour12, minute, second, cfg, 9);
  applyBrightnessAndShow();
}

void displayClock() {
  // Dispatcher: choose display mode
// Boot progress stages ├óΓé¼ΓÇ¥ advances externally as system state changes
enum BootStage {
  BOOT_STAGE_INIT     = 0,  // just started          ├óΓé¼ΓÇ¥ red,    LEDs 0-14
  BOOT_STAGE_AP_UP    = 1,  // AP is up              ├óΓé¼ΓÇ¥ orange, LEDs 0-29
  BOOT_STAGE_SCANNING = 2,  // scanning networks     ├óΓé¼ΓÇ¥ yellow, LEDs 0-44
  BOOT_STAGE_STA_CONN = 3,  // STA connecting        ├óΓé¼ΓÇ¥ blue,   LEDs 0-59
  BOOT_STAGE_WIFI_OK  = 4,  // WiFi connected        ├óΓé¼ΓÇ¥ green,  fill 60
  BOOT_STAGE_NTP_WAIT = 5,  // waiting for NTP       ├óΓé¼ΓÇ¥ cyan,   full bounce
};
BootStage bootStage = BOOT_STAGE_INIT;

void displayBootAnimation() {
  if (!ledStrip) return;

  // Each stage: {r, g, b, lastLED (inclusive), stepMs}
  struct StageStyle { uint8_t r, g, b; uint8_t lastLed; uint8_t stepMs; };
  static const StageStyle styles[] = {
    {80,  0,  0, 14, 60},   // INIT     ├óΓé¼ΓÇ¥ red,    slow
    {80, 40,  0, 29, 50},   // AP_UP    ├óΓé¼ΓÇ¥ orange
    {70, 70,  0, 44, 40},   // SCANNING ├óΓé¼ΓÇ¥ yellow
    { 0, 30, 90, 59, 30},   // STA_CONN ├óΓé¼ΓÇ¥ blue,   fast
    { 0, 80,  0, 59, 20},   // WIFI_OK  ├óΓé¼ΓÇ¥ green,  fast fill
    { 0, 70, 70, 59, 25},   // NTP_WAIT ├óΓé¼ΓÇ¥ cyan
  };

  const StageStyle& s = styles[(int)bootStage];

  static int  pos       = 0;
  static int  dir       = 1;
  static int  fillCount = 0;
  static BootStage lastStage = BOOT_STAGE_INIT;
  static unsigned long lastStep = 0;

  // Reset bounce position when stage changes
  if (bootStage != lastStage) {
    pos = 0; dir = 1; fillCount = 0;
    lastStage = bootStage;
  }

  if (millis() - lastStep < s.stepMs) return;
  lastStep = millis();

  ledStrip->setBrightness(28);
  ledStrip->clear();

  const uint8_t TAIL = 7;

  if (bootStage == BOOT_STAGE_WIFI_OK) {
    // Green creeping fill ├óΓé¼ΓÇ¥ LED 0..fillCount lit, then a bright head
    if (fillCount < NUM_LEDS) fillCount++;
    for (int i = 0; i < fillCount; i++)
      ledStrip->setPixelColor(i, ledStrip->Color(0, 25, 0));
    if (fillCount < NUM_LEDS)
      ledStrip->setPixelColor(fillCount, ledStrip->Color(0, 80, 0));
  } else {
    // Bouncing comet within 0..lastLed
    int span = s.lastLed + 1;

    // Draw tail
    for (int t = 1; t <= TAIL; t++) {
      int idx = pos - dir * t;
      if (idx >= 0 && idx < span) {
        uint8_t fade = (TAIL - t + 1) * 255 / ((TAIL + 1) * 8);
        ledStrip->setPixelColor(idx, ledStrip->Color(
          s.r * fade / 32, s.g * fade / 32, s.b * fade / 32));
      }
    }
    // Draw head
    ledStrip->setPixelColor(pos, ledStrip->Color(s.r, s.g, s.b));

    // Bounce
    pos += dir;
    if (pos >= span) { pos = span - 2; dir = -1; }
    if (pos < 0)     { pos = 1;        dir =  1; }
  }

  ledStrip->show();
}

  switch (displayMode) {
  time_t now = time(nullptr);
  bool ntpSynced = (now >= 86400);

  // forceStatusDisplay beats everything ├óΓé¼ΓÇ¥ always show animation
  // otherwise: show animation until NTP synced, unless forceClockDisplay
  if (forceStatusDisplay || (!ntpSynced && !forceClockDisplay)) {
    displayBootAnimation();
    return;
  }

  // Restore user brightness when transitioning to clock for the first time
  static bool brightnessRestored = false;
  if (!brightnessRestored) {
    if (ledStrip) ledStrip->setBrightness(ledBrightness);
    brightnessRestored = true;
  }

    case DISPLAY_SIMPLE:
      displayMode_Simple();
      break;
    case DISPLAY_PULSE:
      displayMode_Pulse();
      break;
    case DISPLAY_BINARY:
      displayMode_Binary();
      break;
    case DISPLAY_HOUR_MARKER:
      displayMode_HourMarker();
      break;
    case DISPLAY_FLAME:
      displayMode_Flame();
      break;
    case DISPLAY_PASTEL:
      displayMode_Pastel();
      break;
    case DISPLAY_NEON:
      displayMode_Neon();
      break;
    case DISPLAY_COMET:
      displayMode_Comet();
      break;
    case DISPLAY_SOLID:
    default:
      displayClock_Solid();
      break;
  }
}

void displayClock_Solid() {
  int hour12, hour24, minute, second, daySeconds;
  if (!extractClock(hour12, hour24, minute, second, daySeconds)) return;
  const ModeDisplayConfig &cfg = modeConfigs[DISPLAY_SOLID];

  memset(leds, 0, sizeof(leds));
  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t r, g, b;
    hsvToRgb((i * 6 + second * 6) % 360, 180, 30, r, g, b);
    leds[i] = {r, g, b};
  }

  overlayTimeMarkers(hour12, minute, second, cfg, 9);
  applyBrightnessAndShow();
}

// ============================================================================
// EEPROM Functions
// ============================================================================

void saveDisplayModeToEEPROM() {
  EEPROM.begin(EEPROM_SIZE);
  EEPROM.write(EEPROM_DISPLAY_MODE_ADDR, (uint8_t)displayMode);
  EEPROM.commit();
}

