noless-zz/esp8266-led-strip-clock/src/main.cpp
  return true;
}

void updateWiFiConnect() {
  if (!wifiConnect.active) return;

  wl_status_t status = WiFi.status();
  if (status == WL_CONNECTED) {
    wifiConnect.active = false;

  // Log every status change during connection attempt
  if (status != wifiConnect.lastStatus) {
    unsigned long elapsed = millis() - wifiConnect.startedAt;
    Serial.printf("[WiFi] Status changed: %s -> %s  (+%lums)\n",
                  wlStatusName(wifiConnect.lastStatus), wlStatusName(status), elapsed);
    wifiConnect.lastStatus = status;
  }

    wifiConnect.connecting = false;
    wifiConnect.success = true;
    wifiConnected = true;
    Serial.print("[WiFi] Connected! IP: ");
    Serial.println(WiFi.localIP());
    bootStage = BOOT_STAGE_WIFI_OK;
    detectTimezone();
  } else if (status == WL_CONNECT_FAILED || status == WL_NO_SSID_AVAIL) {
    wifiConnect.active = false;
    wifiConnect.connecting = false;
    wifiConnect.success = false;
    wifiConnect.error = "Connection failed";
    Serial.printf("[WiFi] Failed with status %d (%s) after %lums\n",
                  (int)status, wlStatusName(status), millis() - wifiConnect.startedAt);
  } else if (millis() - wifiConnect.startedAt > 20000) {
    // Timeout ├óΓé¼ΓÇ¥ clear state, trigger a fresh scan, retry after scan completes
    wifiConnect.active = false;
    wifiConnect.connecting = false;
    wifiConnect.success = false;
    wifiConnect.error = "Connection timeout";
  }
}
    Serial.printf("[WiFi] Timeout! Last status: %d (%s) ├óΓé¼ΓÇ¥ rescanning and will retry\n",
                  (int)status, wlStatusName(status));
    WiFi.disconnect(false);
    WiFi.scanNetworks(true, true);  // async rescan; boot auto-connect logic will retry
  } else {
    // Heartbeat every 5s so we can see it's still trying
    static unsigned long lastHeartbeat = 0;
    if (millis() - lastHeartbeat > 5000) {
      lastHeartbeat = millis();
      Serial.printf("[WiFi] Still connecting... status=%s  elapsed=%lus\n",
                    wlStatusName(status), (millis() - wifiConnect.startedAt) / 1000);
    }

// ============================================================================
// OTA & Firmware Update
// ============================================================================

uint32_t getMaxUpdateSize() {
  return (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
}

const char* updateErrorToString(uint8_t error) {
  switch (error) {
    case UPDATE_ERROR_OK: return "OK";
    case UPDATE_ERROR_WRITE: return "Flash write failed";
    case UPDATE_ERROR_ERASE: return "Flash erase failed";
    case UPDATE_ERROR_READ: return "Flash read failed";
    case UPDATE_ERROR_SPACE: return "Not enough flash space";
    case UPDATE_ERROR_SIZE: return "Binary size mismatch";
    case UPDATE_ERROR_STREAM: return "Upload stream timeout/error";
    case UPDATE_ERROR_MD5: return "MD5 validation failed";
    case UPDATE_ERROR_MAGIC_BYTE: return "Invalid firmware magic byte";
    case UPDATE_ERROR_FLASH_CONFIG: return "Flash config mismatch";
    case UPDATE_ERROR_NEW_FLASH_CONFIG: return "New flash config invalid";
    case UPDATE_ERROR_BOOTSTRAP: return "Bootstrap validation failed";
    case UPDATE_ERROR_OOM: return "Out of memory during update";
    case UPDATE_ERROR_NO_DATA: return "No OTA data received";
    default: return "Unknown OTA error";
  }
}

// ============================================================================
// Web Pages (HTML)
// ============================================================================

const char INDEX_HTML[] PROGMEM = R"html(
<!DOCTYPE html><html><head><meta charset='utf-8'/><meta name='viewport' content='width=device-width, initial-scale=1'/>
<title>LED Clock</title><style>
*{margin:0;padding:0;box-sizing:border-box}body{font-family:system-ui;background:linear-gradient(135deg,#667eea,#764ba2);
min-height:100vh;padding:20px;color:#333}.container{max-width:600px;margin:0 auto}.clock-card{background:#fff;
border-radius:20px;padding:40px 20px;margin-bottom:20px;box-shadow:0 10px 40px rgba(0,0,0,0.3);text-align:center}
.clock-time{font-size:72px;font-weight:300;letter-spacing:4px;color:#667eea;margin-bottom:10px;font-variant-numeric:tabular-nums}
.card{background:#fff;border-radius:16px;padding:20px;margin-bottom:15px;box-shadow:0 5px 20px rgba(0,0,0,0.2)}
h3{font-size:14px;letter-spacing:2px;text-transform:uppercase;color:#999;margin-bottom:15px}
.grid{display:grid;grid-template-columns:1fr 1fr;gap:15px}.item{padding:12px;background:#f5f5f5;border-radius:8px;text-align:center}
.label{font-size:11px;color:#999;text-transform:uppercase;}
.value{font-size:16px;font-weight:600;color:#333;margin-top:5px}
.btn{width:100%;padding:12px;border:none;border-radius:6px;font-weight:bold;cursor:pointer;text-transform:uppercase;letter-spacing:1px;
background:linear-gradient(135deg,#667eea,#764ba2);color:#fff;margin-bottom:10px}
.btn:active{opacity:0.9}
</style></head><body><div class='container'>
<div class='clock-card'><div class='clock-time' id='time'>--:--:--</div><div style='font-size:16px;color:#999;margin-top:10px;' id='date'>Loading</div></div>
<div class='card'><h3>System</h3><div class='grid'>
<div class='item'><div class='label'>WiFi</div><div class='value' id='wifi'>--</div></div>
<div class='item'><div class='label'>Signal</div><div class='value' id='signal'>--</div></div>
<div class='item'><div class='label'>Timezone</div><div class='value' id='tz'>UTC</div></div>
<div class='item'><div class='label'>NTP</div><div class='value' id='ntp'>--</div></div>
</div></div>
<div class='card'><h3>Device</h3><div class='grid'>
<div class='item'><div class='label'>Firmware</div><div class='value' id='fw' title='Build timestamp' style='cursor:help;font-size:11px'>-</div></div>
<div class='item'><div class='label'>TZ Debug</div><div class='value' id='tz_debug'>manual UTC</div></div>
<div class='item'><div class='label'>Brightness</div><div class='value' id='bright'>-</div></div>
<div class='item'><div class='label'>IP</div><div class='value' style='font-size:12px' id='ip'>-</div></div>
<div class='item'><div class='label'>Heap</div><div class='value' id='heap'>-</div></div>
</div></div>
<button class='btn' onclick='location.href="/settings.html"'>Settings</button>
</div>
<script>
function updateStatus(){fetch('/api/status').then(r=>r.json()).then(d=>{
const now=new Date();document.getElementById('time').textContent=now.toLocaleTimeString('en-US',{hour:'2-digit',minute:'2-digit',second:'2-digit'});
document.getElementById('date').textContent=now.toLocaleDateString('en-US',{weekday:'short',month:'short',day:'numeric'});
document.getElementById('wifi').textContent=d.wifi_connected?'✓ '+d.wifi_ssid:'✗ Offline';
document.getElementById('signal').textContent=d.wifi_rssi?d.wifi_rssi+' dBm':'--';
const tzDebug=d.timezone_auto_detected?'Auto '+d.timezone_utc_offset_hours+'h':'Manual '+d.timezone_utc_offset_hours+'h';
document.getElementById('tz').textContent=d.timezone||'UTC';
document.getElementById('tz_debug').textContent=tzDebug;
document.getElementById('ntp').textContent=d.ntp_synced?'✓ Synced':'⏱ Wait';
document.getElementById('fw').textContent=d.fw_version_base||'-';document.getElementById('fw').title='Build: '+(d.fw_build_time||'unknown');
document.getElementById('bright').textContent=d.brightness+'%';
document.getElementById('ip').textContent=d.ip||'-';
document.getElementById('heap').textContent=Math.round(d.heap/1024)+' KB';
}).catch(e=>console.warn(e));}
setInterval(updateStatus,3000);updateStatus();
</script></body></html>
)html";

